n = int(input("n = "))  # задання та введення цілочисельного n
x = float(input("x = "))  # задання та введення дійсного х
s = 1  # задання початкового значення суми
k = 1  # задання початкового значення для обрахування знаменника члена суми
for i in range(1, n):  # початок арифметичного циклу
    k = k*i  # обрахування факторіалу в знаменнику нового члена суми
    s1 = pow(x, i)/k  # обраховуємо значення поетапного елементу суми
    s += s1  # обрахування кінцевої суми
    # print("s1 = ", s1)
    # print("s = ", s)
# print("k = ", k)
print("S = ", s)  # вивід кінцевого результату
