import math

for i in range(10, 9999):  # початок арифметичного циклу для перебору всіх 2,3 та 4 цифрових чисел
    num = i  # присвоюємо значення лічильника для операцій над ним
    n = int(math.log10(num)+1)  # розраховуємо кількість цифр у числі
    res = 0  # задаємо початкове значення
    for j in range(0, n):  # початок арифметичного циклу для пошуку значень по методу утворення чисел Армстронга
        k = num % 10  # знаходимо останню цифру числа
        num = int(num / 10)  # знаходимо число без останньої цифри (оновлюємо число для наступного кроку циклу)
        s = int(pow(k, n))  # знаходимо кожну цифру окремо у n-тому степені, де n - к-сть цифр у числі
        res += s  # обраховуємо значення "кандидатів" у числа Армстронга
    if res == i:  # перевіряємо умову утворення чисел Армстронга/вибираємо числа армстронга з переліку res
        print(res)  # виводимо всі числа Армстронга з заданого проміжку


# ІІ Вариіант вирішення
# for i in range(10, 9999):
#     res = 0
#     for ch in str(i):
#         res += int(ch)**len(str(i))
#     if i == res:
#         print(res)
