#include <iostream>
using namespace std;

int main()
{
	double x, s, k;// створюємо змінні
	int n;// створюємо змінні
	x = 0.56;// задаємо значення змінних (х)
	n = 1;// задаємо значення змінних (крок)
	s = 0;// задаємо значення змінних (сума виразу)
	k = abs((x * x + 1) / 3);// початкове значення виразу для перевірки умови виходу з циклу
	while (k > pow(10, -4)) {// починаємо цикл
		double s1;// створюємо змінну 
		s1 = pow(-1, n) * (pow(x, 2 * n) + 1) / (pow(2, n) + 1);// задаємо значення поетапного елементу суми
		s += s1;// вираховуємо суму
		n++;// збільшуємо крок на одиницю
		k = abs((pow(x, 2 * n) + 1) / (pow(2, n) + 1));// оновлюємо вираз для перевірки умови виходу з циклу
	}// закриваємо цикл
	cout << "E = " << s;// виводимо результат
}
