#include <iostream>
using namespace std;

int main()
{
	for (int i = 10; i <= 9999; i++) { // початок арифметичного циклу для перебору всіх 2,3 та 4 цифрових чисел
		int num, n, res; // цілочисельний тип
		num = i; // присвоюємо значення лічильника для операцій над ним
		n = (int)(log10(num) + 1); // розраховуємо кількість цифр у числі
		res = 0; // задаємо початкове значення (все неявне робимо явним @Страуструп)
		for (int j = 0; j < n; j++) { // початок арифметичного циклу для пошуку значень по методу утворення чисел Армстронга
			int k, s; // цілочисельний тип
			k = num % 10; // знаходимо останню цифру числа
			num = num / 10; // знаходимо число без останньої цифри (оновлюємо число для наступного кроку циклу)
			s = (int)pow(k, n); // знаходимо кожну цифру окремо у n-тому степені, де n - к-сть цифр у числі
			res += s; // обраховуємо значення "кандидатів" у числа Армстронга
		} // завершуємо внутрішній цикл для пошуку res
		if (res == i) { // перевіряємо умову утворення чисел Армстронга/вибираємо числа армстронга з переліку res
			cout << res << "\n"; // виводимо всі числа Армстронга з заданого проміжку
		} // закінчуємо перевірку та продовжуємо цикл
	} // завершуємо зовнішній цикл з перебором чисел
}