#include <iostream>
using namespace std;
int main()
{
    double m, s, r; // дійсний тип
    int f; // цілий тип
    cout << "m = |ccc.ddd| = "; cin >> m; //ввід заданго числа
    f = m; //обчислення цілої частини
    s = (m - f) * 1000; //обчислення дробової частини
    r = s + f / 1000.0; //обчислення результату
    printf("\nl = %g", r); // вивід результату
    /*double t = double(m - int(m)) * 1000 + int(m) / 1000.0; // короткий вид запису обчислення результату
    printf("\nt = %g", t); // вивід результату */
}
