#include <iostream>
using namespace std;

int main()
{
	int n; // цілочисельний тип: змінна
	double x,s,k; // дійсний тип: змунна, сума, факторіал у знаменнику
	cout << "n = "; cin >> n; // введення n
	cout << "x = "; cin >> x; // введення x
	s = 1; // задання початкового значення суми
	k = 1; // задання початкового значення для обрахування знаменника члена суми
	for (int i = 1; i < n; i++) { // початок арифметичного циклу
		k = k * i; // обрахування факторіалу в знаменнику нового члена суми
		double s1; // дійсний тип: член суми
		s1 = pow(x, i) / k; // обраховуємо значення поетапного елементу суми
		s += s1; // обрахування кінцевої суми
		//cout << "\ns1 = " << s1;
		//cout << "\ns = " << s;
	}
	//cout << "\nk = " << k;
	cout << "\nS = " << s; // вивід кінцевого результату
}
